In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
len(df['col2'].unique())

3

In [11]:
df['col2'].nunique()

3

In [12]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [13]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [14]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [18]:
list(map(lambda x:x*2, df['col1']))

[2, 4, 6, 8]

In [19]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [23]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [24]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [22]:
df.pivot_table(values='D',index=['B', 'A'],columns=['C'])

C          x    y
B   A
one bar  4.0  1.0
    foo  1.0  3.0
two bar  NaN  5.0
    foo  2.0  NaN